/*******************************************************************************  
* ÎÄ¼şÃû³Æ£ºÊıÂë¹Ü¿ØÖÆÊµÑé
* ÊµÑéÄ¿µÄ£º1.ÕÆÎÕÊıÂë¹Ü¶¯Ì¬É¨ÃèµÄ»ù±¾Ô­Àí,ÕÆÎÕÊıÂë¹ÜÏû³ı¡°¹íÓ°¡±µÄ·½·¨
*           2.ÕÆÎÕ51µ¥Æ¬»ú¶¨Ê±Æ÷¹¤×÷Ä£Ê½ºÍÅäÖÃ·½·¨
*           3.ÕÆÎÕkeil uvision¼¯³É¿ª·¢»·¾³ÏÂ£¬ÖĞ¶Ï·şÎñº¯ÊıÉè¼Æ·½·¨
* ÊµÑéÅäÖÃ£ºJ3ÌøÏßÅäÖÃÎªMM·½Ê½£¬J5ÅäÖÃÎªBTN¡¢J2ÅäÖÃÎª1-3ºÍ2-4
* ³ÌĞòÏÖÏó£ºÊıÂë¹Ü¶¯Ì¬ÏÔÊ¾
* Ó²¼ş»·¾³£ºIAP15F2K61S2@11.0592MHz
* ×¢ÒâÊÂÏî£ºÀí½â¶¯Ì¬ÏÔÊ¾ºÍ¾²Ì¬ÏÔÊ¾
* ÈÕÆÚ°æ±¾£º2019-6-24/V2.0
*******************************************************************************/
#include "STC15F2K60S2.h"  //¶¨Òå51µ¥Æ¬»úÌØÊâ¹¦ÄÜ¼Ä´æÆ÷

#include "intrins.h"

code unsigned char tab[] = { 0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,0x80,0x90,0xFF};
unsigned char dspbuf[8] = {10,10,10,10,10,0,0,0};  //ÏÔÊ¾»º³åÇø
unsigned char dspcom = 0;  //ÏÔÊ¾Î»Ñ¡
unsigned char x = 123;
void display();
void Delay100us();
void buzz();//¹Ø·äÃùÆ÷£¬¼ÌµçÆ÷
//Ö÷º¯Êı
void main()
{ 
			void buzz();
			P2 = ((P2 & 0x1f)|0x80);
			P0 = 0xff;
			P2 &= 0x1f;
	
			dspbuf[5] = x/100;
			dspbuf[6] = x%100/10;
			dspbuf[7] = x%10;
	
			while (1) {
				
				P2 = ((P2 & 0x1f)|0x80);
				P0 = 0xff;
				P2 &= 0x1f;
				
				display();
				Delay100us();
				if (dspcom == 6) { //ÔÚµÚÆßÎ»ÏÔÊ¾Ğ¡Êıµã
					P2 = ((P2&0x1f)|0xc0);
					P0 = (1<<dspcom);
					P2 = ((P2&0x1f)|0xe0);
					P0 = 0x7f; 
					P2 &= 0x1f;
				}
				Delay100us();
		
	}

}


		void Delay100us()		//@11.0592MHz
		{
			unsigned char i, j;

			_nop_();
			_nop_();
			i = 2;
			j = 15;
			do
			{
				while (--j);
			} while (--i);
		}
//ÏÔÊ¾º¯Êı
			void display() {   
				
				P2 = ((P2&0x1f)|0xe0);//ÏûÒş
				P0 = 0xff;
				P2 = ((P2&0x1f)|0xc0);¡//ÒÆÎ»£¬Î»¿ØÖÆ
				P0 = (1<<dspcom);
				P2 = ((P2&0x1f)|0xe0);
				P0 = tab[dspbuf[dspcom]]; //¶ÎÂë
				P2 &= 0x1f;
				
				if (++dspcom == 8) {
					dspcom = 0;
				}
			}

			void buzz() {
						P2 = ((P2&0x1f)|0xa0);
						P0 &= 0xaf;
						P2 &= 0x1f;
			}
